# Homework 2:  Selecting, replacing, deriving data (3,4)

In [1]:
import pandas as pd
import numpy as np

Some functions we have covered

- pd.Series()
- df=pd.DataFrame({'A': 1., 'B': pd.Timestamp('20130102'), 'C': pd.Series(1, index=list(range(4)), dtype='float32'), 'D': np.array([3] * 4, dtype='int32'), 'E': pd.Categorical(["test", "train", "test", "train"]), 'F': 'foo'})
- df.T
- df.index 
- df.columns 
- df.sort_values(by='C') 
- df['A'] 
- df.describe(include=['number', 'category', 'all'], percentiles=[.05, .25, .75, .95]) 
- df.max(skipna=False) 
- df.min() 
- df.sum() 
- df.mean() 
- df.unique() 
- df.idxmax() 
- df.iloc 
- df.value_counts() 
- df[['A', 'B']] 
- (df['A']>1) & (df['B']>1) 
- df[df['A']>1, 'B'] 
- df.loc[df['A']==3.14, 'A']=0

pd.Series()
df=pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})
df.T
df.index
df.columns
df.sort_values(by='C')
df['A']

df.describe(include=['number', 'category', 'all'], percentiles=[.05, .25, .75, .95])
df.max(skipna=False)
df.min()
df.sum()
df.mean()
df.unique()

df.idxmax()
df.iloc
df.value_counts()

df[['A', 'B']]
(df['A']>1) & (df['B']>1)
df[df['A']>1, 'B']

df.loc[df['A']==3.14, 'A']=0

Retrieve titanic data

In [2]:
csv_path = 'https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/titanic.csv'
titanic = pd.read_csv(csv_path)
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

|Variable|Definition|Key|
|--- |--- |--- |
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|sex|Sex||
|Age|Age in years||
|sibsp|# of siblings / spouses aboard the Titanic||
|parch|# of parents / children aboard the Titanic||
|ticket|Ticket number||
|fare|Passenger fare||
|cabin|Cabin number||
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|

Pclass Passenger Class (1 = 1st; 2 = 2nd; 3 = 3rd)
survival Survival (0 = No; 1 = Yes)
name Name
sex Sex
age Age
sibsp Number of Siblings/Spouses Aboard
parch Number of Parents/Children Aboard
ticket Ticket Number
fare Passenger Fare (British pound)
cabin Cabin
embarked Port of Embarkation (C = Cherbourg; Q = Queenstown; S = Southampton)

# Selecting data

**Question 1:  How many first class passengers were on the ship?**

In [3]:
titanic['Pclass'].value_counts().loc[1]

216

There were three places passengers embarked from:  C = Cherbourg; Q = Queenstown; S = Southampton

**Question 2:  Which one of these locations had the most first class passengers?**

In [4]:
print(len(titanic.loc[(titanic['Pclass']==1) & (titanic['Embarked']=='C')]))
print(len(titanic.loc[(titanic['Pclass']==1) & (titanic['Embarked']=='Q')]))
print(len(titanic.loc[(titanic['Pclass']==1) & (titanic['Embarked']=='S')]))

85
2
127

**Question 3:  Which embarkation location had the highest percentage of its passengers in first class?**

In [5]:
print(len(titanic.loc[(titanic['Pclass']==1) & (titanic['Embarked']=='C')])/len(titanic[(titanic['Embarked']=='C')]))
print(len(titanic.loc[(titanic['Pclass']==1) & (titanic['Embarked']=='Q')])/len(titanic[(titanic['Embarked']=='Q')]))
print(len(titanic.loc[(titanic['Pclass']==1) & (titanic['Embarked']=='S')])/len(titanic[(titanic['Embarked']=='S')]))

0.5059523809523809
0.025974025974025976
0.1972049689440994

**Exercise 1:  Make 2 new dataframes.** The first called Southampton should contain all of the original dataframe but with only passengers embarking from Southampton.  The second called CherbourgQueenstown should contain all of the original dataframe but with only the passengers embarking from Queenstown and Cherbourg.

In [6]:
Southampton=titanic[titanic['Embarked']=='S']
CherbourgQueenstown=titanic[titanic['Embarked'].isin(['C', 'Q'])]

**Exercise 2:  For each of these new dataframes, find the ratio of the total number of males to females.**  
Was one group more male heavy than the other?

In [7]:
print(len(Southampton[Southampton['Sex']=='male'])/
      len(Southampton[Southampton['Sex']=='female']))
print(len(CherbourgQueenstown[CherbourgQueenstown['Sex']=='male'])/
      len(CherbourgQueenstown[CherbourgQueenstown['Sex']=='female']))

2.1724137931034484
1.2477064220183487

# Replacing data

C, Q, and S are not very descriptive.  Let's make a new dataframe that is simply a copy of titanic (if we operate on the original titanic some things above might break if run out of order).

In [8]:
titanic_copy=titanic

**Exercise 3:  Now in titanic_copy, replace C with Cherbourg, Q with Queenstown and S with Southampton.**

In [9]:
titanic_copy.loc[titanic_copy['Embarked']=='S', 'Embarked']='Southampton'
titanic_copy.loc[titanic_copy['Embarked']=='Q', 'Embarked']='Queenstown'
titanic_copy.loc[titanic_copy['Embarked']=='C', 'Embarked']='Cherbourg'

**Exercise 4:  Replace all passengers having an NaN age.**  
Replace NaN male ages with the average male passenger age and all female passengers having an NaN age with the average female passenger age in titanic_copy.

In [10]:
titanic_copy.loc[titanic_copy['Age'].isna() & (titanic_copy['Sex']=='male'), 'Age'] = np.mean(
    titanic_copy.loc[(titanic_copy['Sex']=='male'), 'Age'])

titanic_copy.loc[titanic_copy['Age'].isna() & (titanic_copy['Sex']=='female'), 'Age'] = np.mean(
    titanic_copy.loc[(titanic_copy['Sex']=='female'), 'Age'])

# Derived data

**Exercise 5:  Create a new column 'YearsLeft' in titanic_copy.**  
It should calculate how many years of life each passenger had left.  The average lifespan at the time was about 55 years.

In [11]:
titanic_copy['YearsLeft']=55-titanic_copy['Age']

**Exercise 6:  For any passenger with a negative 'YearsLeft' replace it with 0.**  
Unfortunately there are 40 people who outlived the average lifespan so their 'YearsLeft' is negative.

In [12]:
titanic_copy.loc[titanic_copy['YearsLeft']<0, 'YearsLeft']=0

**Question 4:  Approximately how many total years of life were lost in the sinking of the Titanic?**

In [13]:
np.sum(titanic_copy.loc[titanic_copy['Survived']==0, 'YearsLeft'])

13634.45533429753